
x= [4.276988964917479   0.880628979960665   0.251487273467141 0.105789122349926  17.893144291128973  12.448983450796760 14.345395266088119  22.783056122902195   3.657017272735169 1.493817333045844  10.481636065202139  14.528252065976755]

global sigma r N 

sigma(1:8) = x(1:8);
r(1:2) = x(9:10); N(1:2) = x(11:12);
L0 = [3140.510368	2683.907152	2560.90984	2211.756112	3253.786	3114.549808	2017.77784	2746.93624	2632.85896	3477.169456	3202.975024	3457.228624	4005.175984	2896.574416];
L = L0*0;
k = 1; 
T1 = 72;
options = odeset('RelTol',1e-8,'AbsTol',[ 1e-4 1e-4 1e-4 1e-4 1e-4 ]);

% CK  单独培养CGF x2 = 0;
t0=[0.2,0,60,10^-6,0];
[T,X]=ode45('ode_1',[0:T1],t0,options);
L(k) = X(end,end); k = k+1;




% 提前接种 Index = [ -4 -2  ]
for T0 = [ 4 2 ]
    t0=[0,0.2,60,10^-6,0];
    [T,X]=ode45('ode_1',[0:T0],t0,options);
    t0=X(end,:);t0(1) = 0.2;
    [T,X]=ode45('ode_1',[0:T1],t0,options);
    L(k) = X(end,end); k = k+1;
end



% 0 同时接种cgb rap 0.2:0.2
t0=[0.2,0.2,60,10^-6,10^-6];
[T,X]=ode45('ode_1',[0:T1],t0,options);
L(k) = X(end,end); k = k+1;



% 延时接种 Index = [ 2	4	6	8	10 ]
for T0 = [ 	2	4 ]
    t0=[0.2,0,60,10^-6,0];
    [T,X]=ode45('ode_1',[0:T0],t0,options);
    t0=X(end,:);t0(2) = 0.2;
    [T,X]=ode45('ode_1',[0:T1-T0],t0,options);
    L(k) = X(end,end); k = k+1;
end






%% 混菌比例组PART1  提前4h 谷氨酸棒杆菌
%   1   2	3	4	5	6		
% 0.2 0.2 0.2 0.4 0.6 0.8   x_1
% 0.6 0.4 0.2 0.2 0.2 0.2   x_2
radio1 = [ 0.2 0.2 0.2 0.4 0.6 0.8; 0.6 0.4 0.2 0.2 0.2 0.2];
T0 = 4;
for index = 1: 6
    t0=[0,radio1(2,index),60,10^-6,0];
    [T,X]=ode45('ode_1',[0:T0],t0,options);
    t0=X(end,:);t0(1) = radio1(1,index);
    [T,X]=ode45('ode_1',[0:T1],t0,options);
    L(k) = X(end,end); k = k+1;
end

%% 混菌比例组PART2  延后2h 谷氨酸棒杆菌
%   1   2			
% 0.2 0.2   x_1
% 0.6 0.4   x_2
radio2 = [ 0.2 0.2; 0.6 0.4];
T0 = 2;
for index = 1: 2
    t0=[radio2(1,index),0,60,10^-6,0];
    [T,X]=ode45('ode_1',[0:T0],t0,options);
    t0=X(end,:);t0(2) = radio2(2,index);
    [T,X]=ode45('ode_1',[0:T1-T0],t0,options);
    L(k) = X(end,end); k = k+1;
end



y = norm(L-L0,inf)/norm(L0,inf);    

% L'


